# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [1]:
# Add Matplotlib inline magic command
%matplotlib inline

# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)

city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data

city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [2]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14,13.83,5.740000e+12,5,Urban
1,South Michelleport,2019-03-04 18:24,30.24,2.340000e+12,72,Urban
2,Port Samanthamouth,2019-02-24 4:29,33.44,2.010000e+12,57,Urban
3,Rodneyfort,2019-02-10 23:22,23.44,5.150000e+12,34,Urban
4,South Jack,2019-03-06 4:28,34.58,3.910000e+12,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [3]:
#  1. Get the total rides for each city type

urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]

ride_count_by_type = pyber_data_df.groupby(["type"]).count()["ride_id"]
ride_count_by_type

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [4]:
# 2. Get the total drivers for each city type

total_drivers_by_type = city_data_df.groupby(["type"]).sum()["driver_count"]
total_drivers_by_type

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [5]:
#  3. Get the total amount of fares for each city type

sum_fares_by_type = pyber_data_df.groupby(["type"]).sum()["fare"]
sum_fares_by_type

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [6]:
#  4. Get the average fare per ride for each city type. 
# dividing the sum of all the fares by the total rides.

avg_fare_by_type = sum_fares_by_type / ride_count_by_type 
avg_fare_by_type

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [7]:
# 5. Get the average fare per driver for each city type. 
# dividing the sum of all the fares by the total drivers.

avg_driver_fare_by_type = sum_fares_by_type / total_drivers_by_type 
avg_driver_fare_by_type

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [8]:
#  6. Create a PyBer summary DataFrame. 
# PyBer summary DataFrame with all the data gathered from Steps 1-5, using the column names shown below:.

pyber_summary_df = pd.DataFrame({"Total Rides": ride_count_by_type, 
                                 "Total Drivers": total_drivers_by_type, 
                                 "Total Fare": sum_fares_by_type,
                                "Average Fare per Ride" : avg_fare_by_type,
                                "Average Fare per Driver" : avg_driver_fare_by_type})
pyber_summary_df

,Total Rides,Total Drivers,Total Fare,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [9]:
#  7. Cleaning up the DataFrame. Delete the index name

pyber_summary_df.index.name = None

In [10]:
#  8. Format the columns.
pyber_summary_df['Total Rides'] = pyber_summary_df['Total Rides'].map("{:,}".format)
pyber_summary_df['Total Drivers'] = pyber_summary_df['Total Drivers'].map("{:,}".format)
pyber_summary_df['Total Fare'] = pyber_summary_df['Total Fare'].map("${:,.2f}".format)
pyber_summary_df['Average Fare per Ride'] = pyber_summary_df['Average Fare per Ride'].map("${:,.2f}".format)
pyber_summary_df['Average Fare per Driver'] = pyber_summary_df['Average Fare per Driver'].map("${:,.2f}".format)
pyber_summary_df

,Total Rides,Total Drivers,Total Fare,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [11]:
# 1. Read the merged DataFrame

pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14,13.83,5.740000e+12,5,Urban
1,South Michelleport,2019-03-04 18:24,30.24,2.340000e+12,72,Urban
2,Port Samanthamouth,2019-02-24 4:29,33.44,2.010000e+12,57,Urban
3,Rodneyfort,2019-02-10 23:22,23.44,5.150000e+12,34,Urban
4,South Jack,2019-03-06 4:28,34.58,3.910000e+12,46,Urban

In [12]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.

pivot_data_df = pyber_data_df.groupby(["date", "type"]).sum()[["fare"]]
pivot_data_df.head()

                            fare
date             type
2019-01-01 0:08  Urban     37.91
2019-01-01 0:46  Suburban  47.74
2019-01-01 12:32 Suburban  25.56
2019-01-01 14:40 Urban      5.42
2019-01-01 14:42 Urban     12.31

In [13]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.

pivot_data_df = pivot_data_df.reset_index()
pivot_data_df.tail(10)

                  date      type   fare
2354   2019-05-07 5:55     Urban   6.89
2355   2019-05-07 7:08  Suburban  20.52
2356   2019-05-07 8:47     Urban  25.83
2357  2019-05-08 11:38     Urban  19.77
2358  2019-05-08 13:10     Urban  18.04
2359   2019-05-08 1:54     Urban  32.69
2360   2019-05-08 2:31     Urban  41.33
2361   2019-05-08 4:20     Urban  21.99
2362   2019-05-08 4:39     Urban  18.45
2363   2019-05-08 7:29     Urban  18.55

In [14]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 

pivot_data_df = pivot_data_df.pivot(index = "date", columns = "type", values = "fare")
pivot_data_df.head(10)

type              Rural  Suburban  Urban
date
2019-01-01 0:08     NaN       NaN  37.91
2019-01-01 0:46     NaN     47.74    NaN
2019-01-01 12:32    NaN     25.56    NaN
2019-01-01 14:40    NaN       NaN   5.42
2019-01-01 14:42    NaN       NaN  12.31
2019-01-01 14:52    NaN     31.15    NaN
2019-01-01 17:22    NaN       NaN  42.11
2019-01-01 21:04    NaN       NaN  11.71
2019-01-01 2:07     NaN     24.07    NaN
2019-01-01 3:46     NaN       NaN   7.57

In [15]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

pivot_data_df = pivot_data_df.loc['2019-01-01':'2019-04-29']
pivot_data_df

type              Rural  Suburban  Urban
date
2019-01-01 0:08     NaN       NaN  37.91
2019-01-01 0:46     NaN     47.74    NaN
2019-01-01 12:32    NaN     25.56    NaN
2019-01-01 14:40    NaN       NaN   5.42
2019-01-01 14:42    NaN       NaN  12.31
...                 ...       ...    ...
2019-04-28 4:34     NaN       NaN  40.46
2019-04-28 8:15     NaN       NaN  22.86
2019-04-28 9:03     NaN       NaN  15.00
2019-04-28 9:10     NaN       NaN   5.73
2019-04-28 9:25     NaN       NaN  37.35

[2182 rows x 3 columns]

In [16]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.

pivot_data_df.index = pd.to_datetime(pivot_data_df.index)
pivot_data_df

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:00    NaN       NaN  37.91
2019-01-01 00:46:00    NaN     47.74    NaN
2019-01-01 12:32:00    NaN     25.56    NaN
2019-01-01 14:40:00    NaN       NaN   5.42
2019-01-01 14:42:00    NaN       NaN  12.31
...                    ...       ...    ...
2019-04-28 04:34:00    NaN       NaN  40.46
2019-04-28 08:15:00    NaN       NaN  22.86
2019-04-28 09:03:00    NaN       NaN  15.00
2019-04-28 09:10:00    NaN       NaN   5.73
2019-04-28 09:25:00    NaN       NaN  37.35

[2182 rows x 3 columns]

In [17]:
# 7. Check that the datatype for the index is datetime using df.info()

pivot_data_df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2182 entries, 2019-01-01 00:08:00 to 2019-04-28 09:25:00
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Rural     114 non-null    float64
 1   Suburban  570 non-null    float64
 2   Urban     1501 non-null   float64
dtypes: float64(3)
memory usage: 68.2 KB

In [18]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

pivot_data_by_week = pivot_data_df.resample("W").sum()
pivot_data_by_week.head(10)

type         Rural  Suburban    Urban
date
2019-01-06  187.92    721.60  1661.68
2019-01-13   67.65   1105.13  2050.43
2019-01-20  306.00   1218.20  1939.02
2019-01-27  179.69   1203.28  2129.51
2019-02-03  333.08   1042.79  2086.94
2019-02-10  115.80    974.34  2162.64
2019-02-17   95.82   1045.50  2235.07
2019-02-24  419.06   1412.74  2466.29
2019-03-03  175.14    858.46  2218.20
2019-03-10  303.94    925.27  2470.93

In [19]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')